
         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: n


Press RETURN to get started!



Router>en
Router#conf
Configuring from terminal, memory, or network [terminal]? t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/0
Router(config-if)#ip address 192.168.0.5 255.255.255.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip address 192.168.0.6 255.255.255.0
% 192.168.0.0 overlaps with GigabitEthernet0/0
Router(config-if)#no shut
% 192.168.0.0 overlaps with GigabitEthernet0/0
GigabitEthernet0/1: incorrect IP address assignment
Router(config-if)#ip address 192.168.0.7 255.255.255.0
% 192.168.0.0 overlaps with GigabitEthernet0/0
Router(config-if)#ip address 192.168.1.7 255.255.255.0
Router(config-if)#ip address 192.168.0.7 255.255.255.0
% 192.168.0.0 overlaps with GigabitEthernet0/0
Router(config-if)#no shut
% 192.168.0.0 overlaps with GigabitEthernet0/0
GigabitEthernet0/1: incorrect IP address assignment
Router(config-if)#ip address 192.168.1.7 255.255.255.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Router(config-if)#exit
Router(config)#
Router(config)#interface GigabitEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#








Router con0 is now available






Press RETURN to get started.













Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip helper-address 192.168.0.1
Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/1
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#
Router(config-if)#exit
Router(config)#
Router(config)#
Router(config)#interface GigabitEthernet0/1
Router(config-if)#exit
Router(config)#








Router con0 is now available






Press RETURN to get started.













Router>
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/1 
Router(config-if)#ip helper-address 192.168.0.5
Router(config-if)#exit
Router(config)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config)#interface GigabitEthernet0/1
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/0
Router(config-if)#ip address 192.168.0.1 255.255.255.0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/0
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip helper-address 192.168.0.1
Router(config-if)#no shut
Router(config-if)#exit
Router(config)#%IP-4-DUPADDR: Duplicate address 192.168.0.1 on GigabitEthernet0/0, sourced by 00D0.97B8.C70A

Router#
%SYS-5-CONFIG_I: Configured from console by console